In [1]:
import pandas as pd
import numpy as np

In [2]:
dict_1={
    'Nombre':['Ringo','John','Paul','George','Yoko'],
    'Edad':[45,34,42,38,47],
    'Salario':[12000,14000,13000,11000,10000],
    'Genero':['M','M','M','M','F']
}

In [7]:
df=pd.DataFrame(dict_1)
df

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [9]:
df_cat=df.select_dtypes(include=['object','category'])
df_num=df.select_dtypes(exclude=['object','category'])

In [53]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import MinMaxScaler,OneHotEncoder

# definir atributos
num_attrib=df_num.columns.tolist()
cat_attrib=df_cat.columns.tolist()

# definir pipeline
full_pipe=ColumnTransformer([('num',MinMaxScaler(),num_attrib),
                            ('cat',OneHotEncoder(sparse=False,drop='first'),cat_attrib)])
pd.DataFrame(full_pipe.fit_transform(df),columns=num_attrib+pd.get_dummies(df_cat,drop_first=True).columns.tolist())

,Edad,Salario,Nombre_John,Nombre_Paul,Nombre_Ringo,Nombre_Yoko,Genero_M
0,0.846154,0.50,0.0,0.0,1.0,0.0,1.0
1,0.000000,1.00,1.0,0.0,0.0,0.0,1.0
2,0.615385,0.75,0.0,1.0,0.0,0.0,1.0
3,0.307692,0.25,0.0,0.0,0.0,0.0,1.0
4,1.000000,0.00,0.0,0.0,0.0,1.0,0.0

Metodos

In [36]:
df.describe(include='all')

       Nombre       Edad      Salario Genero
count       5   5.000000      5.00000      5
unique      5        NaN          NaN      2
top     Ringo        NaN          NaN      M
freq        1        NaN          NaN      4
mean      NaN  41.200000  12000.00000    NaN
std       NaN   5.263079   1581.13883    NaN
min       NaN  34.000000  10000.00000    NaN
25%       NaN  38.000000  11000.00000    NaN
50%       NaN  42.000000  12000.00000    NaN
75%       NaN  45.000000  13000.00000    NaN
max       NaN  47.000000  14000.00000    NaN

In [31]:
df.std(numeric_only=True)

Edad          5.263079
Salario    1581.138830
dtype: float64

In [32]:
df.sum()

Nombre     RingoJohnPaulGeorgeYoko
Edad                           206
Salario                      60000
Genero                       MMMMF
dtype: object

In [33]:
df.median()

Edad          42.0
Salario    12000.0
dtype: float64

In [34]:
df.max()

Nombre      Yoko
Edad          47
Salario    14000
Genero         M
dtype: object

In [35]:
df.min()

Nombre     George
Edad           34
Salario     10000
Genero          F
dtype: object

In [37]:
df.loc[df.Edad==df.Edad.min()]

  Nombre  Edad  Salario Genero
1   John    34    14000      M

In [40]:
df.Edad.abs()

0    45
1    34
2    42
3    38
4    47
Name: Edad, dtype: int64

In [41]:
df.prod(numeric_only=True)

Edad                114768360
Salario    432327041775828992
dtype: int64

In [42]:
df.cumsum()

                    Nombre  Edad  Salario Genero
0                    Ringo    45    12000      M
1                RingoJohn    79    26000     MM
2            RingoJohnPaul   121    39000    MMM
3      RingoJohnPaulGeorge   159    50000   MMMM
4  RingoJohnPaulGeorgeYoko   206    60000  MMMMF

In [45]:
df.Edad.cumsum()

0     45
1     79
2    121
3    159
4    206
Name: Edad, dtype: int64

In [46]:
df.Edad.cumprod()

0           45
1         1530
2        64260
3      2441880
4    114768360
Name: Edad, dtype: int64

In [47]:
df.dtypes

Nombre     object
Edad        int64
Salario     int64
Genero     object
dtype: object

In [55]:
df_dummies=pd.get_dummies(df[['Genero']])
df_dummies

   Genero_F  Genero_M
0         0         1
1         0         1
2         0         1
3         0         1
4         1         0

In [58]:
df_dummies.value_counts()

Genero_F  Genero_M
0         1           4
1         0           1
dtype: int64